#include <iostream>

using namespace std;
int main()
{
	setlocale(LC_ALL, "Russian");
	float C, F;
	cout << "Задание 1" << endl;
	cout << "Введите градусы по фаренгейту" << endl;
	cin >> F;
	C = 5.0 / 9.0 * (F - 32);
	cout << "Температура в цельсиях при " << F << " градусах по фаренгейту - " << C << endl;
	//Задание 2
	cout << "" << endl;
	int h1, h2, h3, m1, m2, m3, s1, s2, s3;
	cout << "Задание 2" << endl;
	cout << "Введите моменты начала и конца некоторго промежутка времени в часах, миннутах и секундах" << endl;
	cin >> h1 >> m1 >> s1 >> h2 >> m2 >> s2;
	h3 = h2 - h1;
	if (m2 < m1)
	{
		m2 = m2 + 60;
		h3--;
	}
	m3 = m2 - m1;
	if (s2 < s1)
	{
		s2 = s2 + 60;
		m3--;
	}
	s3 = s2 - s1;
	cout << h3 << " часов, " << m3 << " минут и " << s3 << " секунд прошло с начала временного промежутка до конца";
	return 0;
}