#include <iostream>

using namespace std;
int main()
{
	setlocale(LC_ALL, "Russian");
	int h, h1, h2, m, m1, m2, s, s1, s2;
	cout << "Введите начальное и конечное время временного промежутка в формате 'часы минуты секунды'" << endl;
	cin >> h1 >> m1 >> s1 >> h2 >> m2 >> s2;
	h = ((h2 * 3600 + m2 * 60 + s2) - (h1 * 3600 + m1 * 60 + s1)) / 3600;
	m = ((h2 * 3600 + m2 * 60 + s2) - (h1 * 3600 + m1 * 60 + s1) - (h * 3600)) / 60;
	s = (h2 * 3600 + m2 * 60 + s2) - (h1 * 3600 + m1 * 60 + s1) - (h * 3600) - (m * 60);
	cout << "Во временном промежутке " << h << " часов, " << m << " минут и " << s << " секунд" << endl;
	return 0;
}